{
    "real_name": "Mark Vick",
    "discogs": "https://www.discogs.com/artist/185549-Mark-Dynamix",
    "wikipedia": "https://en.wikipedia.org/wiki/Mark_Dynamix",
    "profile_pic": "https://i.discogs.com/MlgrkdQSpO7xfqFjtsnm2DuDTWln7r3W5PpTNV5QRiU/rs:fit/g:sm/q:90/h:600/w:441/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE4NTU0/OS0xNjMwMzc1NjY3/LTc2MjgucG5n.jpeg",
    "srh_raves": "search?query=Dynamix",
    "srh_mixtapes": "mixtapes#M",
    "srh_interview": "https://sydneyravehistory.com/dynamix",
    "srh_flyers": "Leave for SRH",
    "profile": {
      "description": "Mark Dynamix born May 1975 in Woolwich, London, UK - has been a pioneer in Australia’s dance music industry for thirty years. Starting at the age of 14 hosting a decades-long running radio show once he had been relocated to Sydney, Australia; Mark's breakout points were becoming resident DJ at the legendary Sublime club in Sydney in 1997; playing music festivals such as Prodigy & Field Of Dreams from 1994 onwards; and regularly hosting Triple J’s ‘Mix Up’ 1997, 1999, 2000, 2001, 2003, 2010. Mark’s history highlights a performance CV around the world: Fabric, the End, the Love Parade, the Boiler Room, Mambo, Café Del Mar; as well as regular tours across North America, Japan & Europe - all whilst solidifying his fan-base over 3 decades of gigs across Australia. He’s headed Ministry of Sound Recordings as Label & Licensing Manager & his ‘Annual 2006’ compilation became the highest-selling Australian compilation of all time (dance, rock or otherwise) at 350,000 physical copies. Accolades have included topping numerous DJ polls over the years as Australia’s best DJ #1 3D World, #2 ITM50, #1 Pop!, nom. DMAs + #5 Best Producer ITM50. <br/2019 saw the release of Mark’s ‘ARCHIVAL: OPENING THE VAULTS’ (#4 iTunes) album of original tracks & remixes for other artists to date, on his own label Long Distance Recordings. Mark’s 2020 E.P ‘Amplification’ (#1 KissFM chart) opens the ‘ARCHIVAL: REMIXED’ album (#1 iTunes Australia/New Zealand/Netherlands #2 iTunes Spain/Bahrain #10 iTunes UK #14 iTunes Japan #27 iTunes Brazil #53 iTunes USA. Defined as “an exploration of engaging & diverse reworkings of Mark’s classic tracks”, "the cream of Australia’s DJ/Producer talent pool infuse their individual flavours on a set of his finest offerings to date". Matt Rowan & Robbie Lowe, Jon George (from Rufus Dü Sol), Data Entry (from Rubber People), Xan Müller, JimiJ, B-tham & Kazuki, Murat Kilic, Steffan Johnson, Tonka, Olivier A, Real Dreamers, Blind Senden, Dave Winnel & Steve May all lend their hands to the project, constructing wild interpretations of the original songs. ARCHIVAL: REMIXED entered the iTunes Dance Albums Australia chart at the #1 spot on 15th Nov 2020. It peaked at #35 on the pop/rock charts in Australia whilst peaking at #21 on the pop/rock charts in the Netherlands. <br/His weekly radio show ‘ELECTRONIQUE’ appears on Melbourne's KISS FM & online, and he continues to promote & host dance events up and down the east coast of Australia. <br/>In 2021, Mark joined up with Danny Muller to start a new group called The Antipodeans. Their first single joined forces with ICEHOUSE to create new reworkings of the classic Hey Little Girl.",
      "sites": [
        "http://www.facebook.com/djmarkdynamix",
        "http://www.mixcloud.com/markdynamix",
        "http://www.soundcloud.com/markdynamix",
        "http://www.instagram.com/markdynamix"
      ]
    },
    "aliases": [
      "Lost In Nova Scotia",
	    "MDX"
    ]
  }